app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    @products = Product.all

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("price", "created_at", "title", "image_url", "updated_at", "description") VALUES(300000.0, '2010-04-12 20:52:02', 'yacht', '/home/aditya/adf.jpg', '2010-04-12 20:52:02', '500 feet luxury cruiser
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2010-04-12 21:28:15', "image_url" = '/images/MSC2002.jpg', "description" = '<p>
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])