app/controllers/store_controller.rb

  def index
     @products=Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title

  def add_to_cart
     product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 0)

 def save_order
   #@cart = find_cart
   @order = Order.new(params[:order])
   @order.add_line_items_from_cart(@cart)
   if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2010-04-25 11:25:56', 6, 3, 4, 1199.85, '2010-04-25 11:25:56')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('d', 'xfd', '2010-04-25 06:39:44', '2010-04-25 06:39:44', 'cc', 'dds')