app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all , :order => :name)

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('Aditya', '-6219952280.712090388590472', '2010-04-27 15:56:07', '2010-04-27 15:56:07', '8bae9398c3cbb1b194a34d70fe776319ee07bc0b')
---
  def create
    @user = User.new(params[:user])


    respond_to do |format|
      if @user.save